
import { Book, Category } from './types';

export const CATEGORIES: Category[] = [
  { id: '1', name: 'علوم شرعية', icon: '🕌' },
  { id: '2', name: 'لغة عربية', icon: '🖋️' },
  { id: '3', name: 'تاريخ', icon: '📜' },
  { id: '4', name: 'ثقافة عامة', icon: '🌍' },
  { id: '5', name: 'أدب', icon: '📖' },
  { id: '6', name: 'فلسفة', icon: '🧠' },
  { id: '7', name: 'روايات', icon: '🎭' },
  { id: '8', name: 'كتب متنوعة', icon: '📚' }
];

export const MOCK_BOOKS: Book[] = [
  {
    id: 'godot-1952',
    title: 'في انتظار جودو',
    author: 'صمويل بيكيت',
    category: 'أدب',
    description: 'مسرحية فلسفية تناقش عبثية الانتظار ومعنى الوجود الإنساني، وتعد من أهم أعمال مسرح العبث.',
    authorBio: 'صمويل بيكيت (1906-1989) كاتب إيرلندي حائز على جائزة نوبل في الأدب، اشتهر بأسلوبه العبثي في الكتابة المسرحية والروائية.',
    year: '1952',
    coverUrl: 'https://i.postimg.cc/d3BBK1pm/Screenshot-20251231-210959-com-huawei-hwread-dz-edit-382134699900542.jpg',
    readUrl: 'https://pdfhost.io/v/kzm6bbcXvA_ÙÙØªØ¨Ø©_Ø§ÙÙØ¹Ø±ÙØ©_ÙÙ_Ø§ÙØªØ¸Ø§Ø±_Ø¬ÙØ¯Ù_ØµÙÙÙÙ_Ø¨ÙÙÙØª'
  }
];
